{"class_name": "Functional", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_6"}, "name": "input_6", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_184", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_184", "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_185", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_185", "inbound_nodes": [[["conv2d_184", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_54", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_54", "inbound_nodes": [[["conv2d_185", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_119", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_119", "inbound_nodes": [[["mc_dropout_54", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_53", "trainable": true, "dtype": "float32"}, "name": "add_53", "inbound_nodes": [[["activation_119", 0, 0, {}], ["conv2d_184", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_186", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_186", "inbound_nodes": [[["add_53", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_120", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_120", "inbound_nodes": [[["conv2d_186", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_54", "trainable": true, "dtype": "float32"}, "name": "add_54", "inbound_nodes": [[["activation_120", 0, 0, {}], ["conv2d_184", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_187", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_187", "inbound_nodes": [[["add_54", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_121", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_121", "inbound_nodes": [[["conv2d_187", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_188", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_188", "inbound_nodes": [[["activation_121", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_55", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_55", "inbound_nodes": [[["conv2d_188", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_122", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_122", "inbound_nodes": [[["mc_dropout_55", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_55", "trainable": true, "dtype": "float32"}, "name": "add_55", "inbound_nodes": [[["activation_122", 0, 0, {}], ["activation_121", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_189", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_189", "inbound_nodes": [[["add_55", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_123", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_123", "inbound_nodes": [[["conv2d_189", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_56", "trainable": true, "dtype": "float32"}, "name": "add_56", "inbound_nodes": [[["activation_123", 0, 0, {}], ["activation_121", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_190", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_190", "inbound_nodes": [[["add_56", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_124", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_124", "inbound_nodes": [[["conv2d_190", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_57", "trainable": true, "dtype": "float32"}, "name": "add_57", "inbound_nodes": [[["activation_124", 0, 0, {}], ["conv2d_184", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_20", "inbound_nodes": [[["add_57", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_191", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_191", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_192", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_192", "inbound_nodes": [[["conv2d_191", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_56", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_56", "inbound_nodes": [[["conv2d_192", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_125", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_125", "inbound_nodes": [[["mc_dropout_56", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_58", "trainable": true, "dtype": "float32"}, "name": "add_58", "inbound_nodes": [[["activation_125", 0, 0, {}], ["conv2d_191", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_193", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_193", "inbound_nodes": [[["add_58", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_126", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_126", "inbound_nodes": [[["conv2d_193", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_59", "trainable": true, "dtype": "float32"}, "name": "add_59", "inbound_nodes": [[["activation_126", 0, 0, {}], ["conv2d_191", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_194", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_194", "inbound_nodes": [[["add_59", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_127", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_127", "inbound_nodes": [[["conv2d_194", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_195", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_195", "inbound_nodes": [[["activation_127", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_57", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_57", "inbound_nodes": [[["conv2d_195", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_128", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_128", "inbound_nodes": [[["mc_dropout_57", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_60", "trainable": true, "dtype": "float32"}, "name": "add_60", "inbound_nodes": [[["activation_128", 0, 0, {}], ["activation_127", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_196", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_196", "inbound_nodes": [[["add_60", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_129", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_129", "inbound_nodes": [[["conv2d_196", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_61", "trainable": true, "dtype": "float32"}, "name": "add_61", "inbound_nodes": [[["activation_129", 0, 0, {}], ["activation_127", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_197", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_197", "inbound_nodes": [[["add_61", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_130", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_130", "inbound_nodes": [[["conv2d_197", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_62", "trainable": true, "dtype": "float32"}, "name": "add_62", "inbound_nodes": [[["activation_130", 0, 0, {}], ["conv2d_191", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_21", "inbound_nodes": [[["add_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_198", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_198", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_199", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_199", "inbound_nodes": [[["conv2d_198", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_58", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_58", "inbound_nodes": [[["conv2d_199", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_131", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_131", "inbound_nodes": [[["mc_dropout_58", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_63", "trainable": true, "dtype": "float32"}, "name": "add_63", "inbound_nodes": [[["activation_131", 0, 0, {}], ["conv2d_198", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_200", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_200", "inbound_nodes": [[["add_63", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_132", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_132", "inbound_nodes": [[["conv2d_200", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_64", "trainable": true, "dtype": "float32"}, "name": "add_64", "inbound_nodes": [[["activation_132", 0, 0, {}], ["conv2d_198", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_201", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_201", "inbound_nodes": [[["add_64", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_133", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_133", "inbound_nodes": [[["conv2d_201", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_202", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_202", "inbound_nodes": [[["activation_133", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_59", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_59", "inbound_nodes": [[["conv2d_202", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_134", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_134", "inbound_nodes": [[["mc_dropout_59", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_65", "trainable": true, "dtype": "float32"}, "name": "add_65", "inbound_nodes": [[["activation_134", 0, 0, {}], ["activation_133", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_203", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_203", "inbound_nodes": [[["add_65", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_135", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_135", "inbound_nodes": [[["conv2d_203", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_66", "trainable": true, "dtype": "float32"}, "name": "add_66", "inbound_nodes": [[["activation_135", 0, 0, {}], ["activation_133", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_204", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_204", "inbound_nodes": [[["add_66", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_136", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_136", "inbound_nodes": [[["conv2d_204", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_67", "trainable": true, "dtype": "float32"}, "name": "add_67", "inbound_nodes": [[["activation_136", 0, 0, {}], ["conv2d_198", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_22", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_22", "inbound_nodes": [[["add_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_205", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_205", "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_206", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_206", "inbound_nodes": [[["conv2d_205", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_60", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_60", "inbound_nodes": [[["conv2d_206", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_137", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_137", "inbound_nodes": [[["mc_dropout_60", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_68", "trainable": true, "dtype": "float32"}, "name": "add_68", "inbound_nodes": [[["activation_137", 0, 0, {}], ["conv2d_205", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_207", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_207", "inbound_nodes": [[["add_68", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_138", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_138", "inbound_nodes": [[["conv2d_207", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_69", "trainable": true, "dtype": "float32"}, "name": "add_69", "inbound_nodes": [[["activation_138", 0, 0, {}], ["conv2d_205", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_208", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_208", "inbound_nodes": [[["add_69", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_139", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_139", "inbound_nodes": [[["conv2d_208", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_209", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_209", "inbound_nodes": [[["activation_139", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_61", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_61", "inbound_nodes": [[["conv2d_209", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_140", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_140", "inbound_nodes": [[["mc_dropout_61", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_70", "trainable": true, "dtype": "float32"}, "name": "add_70", "inbound_nodes": [[["activation_140", 0, 0, {}], ["activation_139", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_210", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_210", "inbound_nodes": [[["add_70", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_141", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_141", "inbound_nodes": [[["conv2d_210", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_71", "trainable": true, "dtype": "float32"}, "name": "add_71", "inbound_nodes": [[["activation_141", 0, 0, {}], ["activation_139", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_211", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_211", "inbound_nodes": [[["add_71", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_142", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_142", "inbound_nodes": [[["conv2d_211", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_72", "trainable": true, "dtype": "float32"}, "name": "add_72", "inbound_nodes": [[["activation_142", 0, 0, {}], ["conv2d_205", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_23", "inbound_nodes": [[["add_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_212", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_212", "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_213", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_213", "inbound_nodes": [[["conv2d_212", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_62", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_62", "inbound_nodes": [[["conv2d_213", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_143", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_143", "inbound_nodes": [[["mc_dropout_62", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_73", "trainable": true, "dtype": "float32"}, "name": "add_73", "inbound_nodes": [[["activation_143", 0, 0, {}], ["conv2d_212", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_214", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_214", "inbound_nodes": [[["add_73", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_144", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_144", "inbound_nodes": [[["conv2d_214", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_74", "trainable": true, "dtype": "float32"}, "name": "add_74", "inbound_nodes": [[["activation_144", 0, 0, {}], ["conv2d_212", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_215", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_215", "inbound_nodes": [[["add_74", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_145", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_145", "inbound_nodes": [[["conv2d_215", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_216", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_216", "inbound_nodes": [[["activation_145", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_63", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_63", "inbound_nodes": [[["conv2d_216", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_146", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_146", "inbound_nodes": [[["mc_dropout_63", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_75", "trainable": true, "dtype": "float32"}, "name": "add_75", "inbound_nodes": [[["activation_146", 0, 0, {}], ["activation_145", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_217", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_217", "inbound_nodes": [[["add_75", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_147", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_147", "inbound_nodes": [[["conv2d_217", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_76", "trainable": true, "dtype": "float32"}, "name": "add_76", "inbound_nodes": [[["activation_147", 0, 0, {}], ["activation_145", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_218", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_218", "inbound_nodes": [[["add_76", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_148", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_148", "inbound_nodes": [[["conv2d_218", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_77", "trainable": true, "dtype": "float32"}, "name": "add_77", "inbound_nodes": [[["activation_148", 0, 0, {}], ["conv2d_212", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_16", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_16", "inbound_nodes": [[["add_77", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_12", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMaAAAAdABqAXwAZAEZAHwAZAIZAGcCZANkBI0CUwCp\nBU7pAAAAAOkBAAAA6QMAAACpAdoEYXhpc6kC2gFL2gtjb25jYXRlbmF0ZakB2gF4qQByDAAAAPov\nL3Jvb3QvRGF0YXNldF9wY2EvZHBfbW9kZWxzL2F0dG5fbXVsdGlfbW9kZWwucHnaCDxsYW1iZGE+\nGQAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "dp_models.attn_multi_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_12", "inbound_nodes": [[["up_sampling2d_16", 0, 0, {}], ["add_72", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_219", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_219", "inbound_nodes": [[["lambda_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_220", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_220", "inbound_nodes": [[["conv2d_219", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_64", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_64", "inbound_nodes": [[["conv2d_220", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_149", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_149", "inbound_nodes": [[["mc_dropout_64", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_78", "trainable": true, "dtype": "float32"}, "name": "add_78", "inbound_nodes": [[["activation_149", 0, 0, {}], ["conv2d_219", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_221", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_221", "inbound_nodes": [[["add_78", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_150", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_150", "inbound_nodes": [[["conv2d_221", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_79", "trainable": true, "dtype": "float32"}, "name": "add_79", "inbound_nodes": [[["activation_150", 0, 0, {}], ["conv2d_219", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_222", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_222", "inbound_nodes": [[["add_79", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_151", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_151", "inbound_nodes": [[["conv2d_222", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_223", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_223", "inbound_nodes": [[["activation_151", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_65", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_65", "inbound_nodes": [[["conv2d_223", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_152", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_152", "inbound_nodes": [[["mc_dropout_65", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_80", "trainable": true, "dtype": "float32"}, "name": "add_80", "inbound_nodes": [[["activation_152", 0, 0, {}], ["activation_151", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_224", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_224", "inbound_nodes": [[["add_80", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_153", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_153", "inbound_nodes": [[["conv2d_224", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_81", "trainable": true, "dtype": "float32"}, "name": "add_81", "inbound_nodes": [[["activation_153", 0, 0, {}], ["activation_151", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_225", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_225", "inbound_nodes": [[["add_81", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_154", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_154", "inbound_nodes": [[["conv2d_225", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_82", "trainable": true, "dtype": "float32"}, "name": "add_82", "inbound_nodes": [[["activation_154", 0, 0, {}], ["conv2d_219", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "up_sampling2d_17", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "up_sampling2d_17", "inbound_nodes": [[["add_82", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_13", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAUwAAAHMaAAAAdABqAXwAZAEZAHwAZAIZAGcCZANkBI0CUwCp\nBU7pAAAAAOkBAAAA6QMAAACpAdoEYXhpc6kC2gFL2gtjb25jYXRlbmF0ZakB2gF4qQByDAAAAPov\nL3Jvb3QvRGF0YXNldF9wY2EvZHBfbW9kZWxzL2F0dG5fbXVsdGlfbW9kZWwucHnaCDxsYW1iZGE+\nGQAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "dp_models.attn_multi_model", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_13", "inbound_nodes": [[["up_sampling2d_17", 0, 0, {}], ["add_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_226", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_226", "inbound_nodes": [[["lambda_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_227", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_227", "inbound_nodes": [[["conv2d_226", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_66", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_66", "inbound_nodes": [[["conv2d_227", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_155", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_155", "inbound_nodes": [[["mc_dropout_66", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_83", "trainable": true, "dtype": "float32"}, "name": "add_83", "inbound_nodes": [[["activation_155", 0, 0, {}], ["conv2d_226", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_228", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_228", "inbound_nodes": [[["add_83", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_156", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_156", "inbound_nodes": [[["conv2d_228", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_84", "trainable": true, "dtype": "float32"}, "name": "add_84", "inbound_nodes": [[["activation_156", 0, 0, {}], ["conv2d_226", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_229", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_229", "inbound_nodes": [[["add_84", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_157", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_157", "inbound_nodes": [[["conv2d_229", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_230", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_230", "inbound_nodes": [[["activation_157", 0, 0, {}]]]}, {"class_name": "MCDropout", "config": {"name": "mc_dropout_67", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "mc_dropout_67", "inbound_nodes": [[["conv2d_230", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_158", "trainable": true,